In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("income.csv",names=["name","income"],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [6]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [7]:
# Zero Percentile
df.income.quantile(0)

4000.0

In [9]:
# 25th Percentile
df.income.quantile(0.25,interpolation="higher")

6000

In [10]:
#50th percentile
df.income.quantile(0.5,interpolation="higher")

7000

In [11]:
#75th percentile
df.income.quantile(0.75)

7750.0

In [13]:
#100 percentile
df.income.quantile(1)

10000000.0

In [16]:
percentile_99 = df.income.quantile(.99)
percentile_99

9400479.999999994

In [17]:
df[df.income > percentile_99]

        name    income
6  Elon Musk  10000000

In [18]:
df = df[df.income < percentile_99]
df

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [19]:
df['income'][3] = np.NaN

/var/folders/h4/qqz2p91x5h167vpp_3z4_s3w0000gn/T/ipykernel_1870/2943373670.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3] = np.NaN

In [20]:
df

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia     NaN
4  Mohan  8000.0
5    Tao  7000.0

In [21]:
df.income.mean()

6000.0

In [22]:
df_new = df.fillna(df.income.mean())
df_new

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia  6000.0
4  Mohan  8000.0
5    Tao  7000.0